In [2]:
import pandas as pd

In [41]:
df = pd.read_html('https://sos.ga.gov/elections/election_results/2011_1108/00525.htm')

In [42]:
df = df[2]

In [43]:
df.shape

(4, 18)

In [44]:
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17
0,NaN,NaN,Banks (R) 982,"Dunahoo (R) 1,063",Godfrey (D) 372,Ottaviano (R) 264,Reed (R) 934,Sykes (R) 702,Yardley (R) 667,"Totals 4,984",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,19.7%,21.3%,7.5%,5.3%,18.7%,14.1%,13.4%,100.0%,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,County,PPR,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,HALL,100%,982,1063,372,264,934,702,667,4984,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [45]:
df = df[3:]

In [46]:
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17
3,HALL,100%,982,1063,372,264,934,702,667,4984,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [47]:
df = df[df.columns[[0,2,3,4,5,6,7,8]]]

In [48]:
df.head()

      0    2     3    4    5    6    7    8
3  HALL  982  1063  372  264  934  702  667

In [49]:
df.columns = [
    'county',
    'Bobby Banks',
    'Emory West Dunahoo Jr',
    'Paul Wayne Godfrey',
    'Dominic Ottaviano',
    'Todd W. Reed',
    'William (Sonny) Sykes',
    'Kris Yardley'
]

In [50]:
df.tail()

,county,Bobby Banks,Emory West Dunahoo Jr,Paul Wayne Godfrey,Dominic Ottaviano,Todd W. Reed,William (Sonny) Sykes,Kris Yardley
3,HALL,982,1063,372,264,934,702,667

In [51]:
df = df.melt(id_vars=['county'])

In [52]:
df.columns = ['county', 'candidate', 'votes']

In [53]:
df.head()

  county              candidate votes
0   HALL            Bobby Banks   982
1   HALL  Emory West Dunahoo Jr  1063
2   HALL     Paul Wayne Godfrey   372
3   HALL      Dominic Ottaviano   264
4   HALL           Todd W. Reed   934

In [54]:
df['votes'] = df['votes'].astype(int)

In [55]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   county     7 non-null      object
 1   candidate  7 non-null      object
 2   votes      7 non-null      int64
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

In [56]:
df['office'] = 'State House'
df['district'] = '25'

# df['office'] = 'State Senate'
# df['district'] = '50'

# df['party'] = 'Nonpartisan'
# df['party'] = 'Democrat'
df['party'] = 'Republican'

df.loc[(df['candidate'] == 'Paul Wayne Godfrey'),'party'] = 'Democrat'

In [57]:
df.groupby(['candidate', 'party'])['votes'].sum()

candidate              party
Bobby Banks            Republican     982
Dominic Ottaviano      Republican     264
Emory West Dunahoo Jr  Republican    1063
Kris Yardley           Republican     667
Paul Wayne Godfrey     Democrat       372
Todd W. Reed           Republican     934
William (Sonny) Sykes  Republican     702
Name: votes, dtype: int64

In [58]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].head()

  county       office district       party              candidate  votes
0   HALL  State House       25  Republican            Bobby Banks    982
1   HALL  State House       25  Republican  Emory West Dunahoo Jr   1063
2   HALL  State House       25    Democrat     Paul Wayne Godfrey    372
3   HALL  State House       25  Republican      Dominic Ottaviano    264
4   HALL  State House       25  Republican           Todd W. Reed    934

In [59]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].to_clipboard(index=False, sep=',')